<?php
    $array_hsp = json_encode([[119.302831, 26.032383, '福州肺科医院'],
    [118.053898, 24.566955, '厦门大学附属第一医院杏林分院'],
    [117.652196, 24.518144, '漳州市医院'],
    [117.676604, 24.528719, '解放军联勤保障部队第909医院（厦门大学附属东南医院第909医院）'],
    [118.673259, 24.929678, '泉州市第一医院'],
    [117.642095, 26.267456, '三明市第一医院'],
    [119.038823, 25.453734, '莆田学院附属医院'],
    [119.087158, 25.380694, '莆田市第一医院'],
    [117.035771, 25.104547, '龙岩市第一医院'],
    [117.007292, 25.113148, '龙岩市第二医院'],
    [117.021847, 25.09798, '龙岩市中医院'],
    [119.576741, 26.673238, '宁德市医院'],
    [119.661405, 27.088892, '宁德市闽东医院'],
    [118.182337, 26.637336, '南平市第一医院'],
    [117.492317, 27.352713, '南平市第二医院'],
    [118.18679, 26.645573, '南平市人民医院'],
    [119.794643, 25.510788, '平潭综合实验区医院'],
    [119.342627, 26.074517, '晋安区医院'],
    [119.445519, 26.004534, '马尾区医院'],
    [119.526387, 25.965313, '长乐区医院'],
    [119.351122, 25.73489, '福清市医院'],
    [119.167138, 26.152164, '闽侯县医院(含高新区)'],
    [119.542141, 26.200308, '连江县医院'],
    [119.55557, 26.492912, '罗源县医院'],
    [118.877365, 26.224864, '闽清县医院'],
    [118.934193, 25.873412, '永泰县医院'],
    [117.660505, 24.520165, '漳州市人民医院'],
    [117.699927, 24.521044, '漳州市第三医院'],
    [117.815814, 24.444269, '龙海市第一医院'],
    [117.611207, 24.124388, '漳浦县医院'],
    [117.342131, 23.961951, '云霄县医院'],
    [117.424733, 23.708346, '东山县医院'],
    [117.160159, 23.73867, '诏安县总医院'],
    [117.327773, 24.36959, '平和县医院'],
    [117.390737, 24.520678, '南靖县医院'],
    [117.540586, 25.010068, '华安县总医院'],
    [117.765947, 24.626982, '长泰县医院'],
    [117.904844, 24.526156, '漳州市第五医院'],
    [117.815814, 24.444269, '漳州招商局经济技术开发区第一医院'],
    [117.619215, 23.953346, '古雷港区医院'],
    [118.188264, 25.056671, '安溪县医院'],
    [118.626943, 25.122186, '洛江区医院'],
    [118.58075, 24.814826, '晋江市医院'],
    [118.803924, 25.040699, '惠安县医院'],
    [118.689728, 24.74031, '石狮市医院'],
    [118.785457, 24.889917, '台商投资区医院'],
    [118.939333, 25.129311, '泉港区医院'],
    [118.389283, 24.959628, '南安市医院'],
    [118.480923, 25.112037, '泉州市光前医院'],
    [118.275296, 25.32474, '永春县医院'],
    [118.250508, 25.498386, '德化县医院'],
    [117.60949, 26.238561, '三明市中西医结合医院'],
    [117.369481, 25.973955, '永安总医院'],
    [117.798561, 26.402813, '沙县总医院'],
    [117.211345, 26.360888, '明溪县总医院'],
    [116.823593, 26.183357, '清流县总医院'],
    [116.660426, 26.267956, '宁化县总医院'],
    [117.477409, 26.73521, '将乐县总医院'],
    [117.182596, 26.90566, '泰宁县总医院'],
    [116.852506, 26.836825, '建宁县总医院'],
    [118.19744, 26.176218, '尤溪县总医院'],
    [117.85344, 25.698933, '大田县总医院'],
    [118.698454, 25.368291, '仙游县总医院'],
    [119.019482, 25.439754, '荔城区医院'],
    [119.122567, 25.464464, '涵江区医院'],
    [119.097307, 25.319097, '秀屿区医院'],
    [118.188706, 26.642774, '延平区医院'],
    [117.502838, 27.341427, '邵武市立医院'],
    [117.829759, 26.798206, '顺昌县医院'],
    [117.339922, 27.54777, '光泽县医院'],
    [118.13757, 27.340537, '南平市建阳第一医院'],
    [118.336465, 27.046101, '建瓯市立医院'],
    [118.019948, 27.734171, '武夷山市立医院'],
    [118.5483, 27.923688, '浦城县医院'],
    [118.862595, 27.369267, '政和县医院'],
    [118.792551, 27.536548, '松溪县医院'],
    [117.036165, 25.097362, '龙岩人民医院'],
    [116.736704, 24.732659, '永定区医院'],
    [116.41692, 25.054602, '上杭县医院'],
    [116.113756, 25.097006, '武平县医院'],
    [116.362508, 25.837446, '汀州医院'],
    [117.422732, 25.284698, '漳平市医院'],
    [116.752039, 25.701715, '连城县医院'],
    [120.222966, 27.328023, '福鼎市医院'],
    [119.533442, 26.666739, '蕉城区医院'],
    [119.687123, 26.976045, '福安市医院'],
    [120.00396, 26.891317, '霞浦县医院'],
    [118.751274, 26.58482, '古田县医院'],
    [119.349068, 27.109566, '周宁县医院'],
    [119.522927, 27.457021, '寿宁县医院'],
    [118.99022, 26.918015, '屏南县医院'],
    [119.907718, 27.243911, '柘荣县医院'],
    
    
    [120.184319, 30.26161, '浙江大学医学院附属第一医院'],
    [120.051574, 30.242281, '杭州市西溪医院'],
    [120.275514, 30.162905, '萧山区第一人民医院'],
    [120.312289, 30.405891, '余杭区第一人民医院'],
    [119.937916, 30.07405, '富阳区人民医院'],
    [119.702106, 29.804578, '桐庐县第一人民医院'],
    [119.725601, 30.240564, '临安区人民医院'],
    [119.515295, 29.546271, '建德市第二人民医院'],
    [119.117215, 29.611121, '淳安县第一人民医院'],
    [121.550902, 29.889372, '中国科学院大学宁波华美医院'],
    [121.568056, 29.860594, '宁波市医疗中心李惠利医院'],
    [121.553326, 29.873806, '宁波市第一医院'],
    [121.56711, 29.889345, '宁波大学医学院附属医院'],
    [121.293777, 30.195948, '宁波市妇女儿童医院'],
    [121.522868, 29.922459, '宁波市第九医院'],
    [121.60715, 29.97956, '宁波市镇海区人民医院'],
    [121.849328, 29.893533, '宁波市北仑区人民医院'],
    [121.58005, 29.870185, '宁波市鄞州人民医院'],
    [121.562452, 29.827217, '宁波市鄞州区第二医院'],
    [121.414859, 29.662698, '宁波市奉化区人民医院'],
    [121.18539, 30.068516, '余姚市人民医院'],
    [121.266822, 30.164421, '慈溪市人民医院'],
    [121.446566, 29.306811, '宁海县第一医院'],
    [121.895834, 29.476743, '象山县第一人民医院'],
    [120.865065, 28.036304, '温州市第六人民医院'],
    [120.609552, 28.026019, '鹿城区人民医院'],
    [120.690179, 27.980016, '瓯海区第三人民医院'],
    [120.833537, 27.919675, '龙湾区第一人民医院'],
    [121.162753, 27.846391, '洞头区人民医院'],
    [120.642784, 27.788408, '瑞安市人民医院'],
    [120.977008, 28.110288, '乐清市人民医院'],
    [120.584382, 27.643017, '平阳县人民医院'],
    [120.457114, 27.521671, '苍南县人民医院'],
    [120.697378, 28.163071, '永嘉县人民医院'],
    [120.095547, 27.794463, '文成县人民医院'],
    [119.727187, 27.550973, '泰顺县人民医院'],
    [120.101963, 30.872941, '湖州市中心医院'],
    [120.412788, 30.85859, '湖州市南浔区人民医院'],
    [119.969868, 30.542326, '德清县人民医院（英溪南路）'],
    [120.094944, 30.549715, '德清县人民医院（医东路）'],
    [119.918995, 31.022419, '长兴县人民医院'],
    [119.79761, 30.79011, '安吉县第二人民医院'],
    [120.748754, 30.742472, '嘉兴市第一医院'],
    [120.899338, 30.949658, '嘉善县第一人民医院'],
    [121.050459, 30.705382, '平湖市第一人民医院'],
    [120.926208, 30.517994, '海盐县人民医院'],
    [120.696703, 30.51022, '海宁市第一人民医院'],
    [120.58833, 30.629255, '桐乡市第一人民医院'],
    [120.59939, 30.028384, '绍兴市人民医院'],
    [120.593477, 29.959418, '绍兴文理学院附属医院'],
    [120.504925, 30.087795, '绍兴市中心医院 '],
    [120.197589, 29.729413, '诸暨市人民医院 '],
    [120.888007, 30.040993, '上虞人民医院'],
    [120.825635, 29.56773, '嵊州市人民医院 '],
    [120.902397, 29.507629, '新昌县人民医院 '],
    [122.21885, 29.99883, '舟山医院'],
    [122.114701, 30.018264, '定海区中心医院'],
    [122.331256, 29.987412, '普陀医院'],
    [122.214561, 30.252817, '岱山县第一人民医院'],
    [122.460659, 30.730073, '嵊泗县人民医院'],
    [119.665602, 29.111724, '金华市中心医院'],
    [119.432199, 29.21355, '兰溪市人民医院（城西院区）'],
    [119.485109, 29.215159, '兰溪市人民医院（城东院区）'],
    [120.230465, 29.2731, '东阳市人民医院'],
    [120.089429, 29.292797, '义乌市中心医院'],
    [120.066313, 28.899812, '永康市第一人民医院'],
    [119.82088, 28.876358, '武义县第一人民医院'],
    [119.927337, 29.454473, '浦江县人民医院'],
    [120.457905, 29.058042, '磐安县人民医院'],
    [118.879438, 28.968716, '衢州市人民医院'],
    [118.504778, 28.917074, '常山县人民医院'],
    [118.634334, 28.731816, '江山市人民医院'],
    [118.416152, 29.124327, '开化县人民医院'],
    [119.183462, 29.041917, '龙游县人民医院'],
    [118.959276, 28.980996, '衢江区人民医院'],
    [118.865845, 28.944294, '柯城区人民医院'],
    [121.120699, 28.851922, '浙江省台州医院'],
    [121.34604, 28.593348, '台州恩泽医疗中心（集团）恩泽医院'],
    [121.446142, 28.682134, '台州市立医院'],
    [121.354298, 28.409422, '台州市第一人民医院'],
    [121.157667, 28.862485, '临海市第一人民医院'],
    [121.502784, 28.77637, '临海市第二人民医院'],
    [121.354559, 28.408828, '温岭市第一人民医院'],
    [121.239273, 28.126059, '玉环县人民医院'],
    [120.993846, 29.16252, '天台县人民医院'],
    [120.749854, 28.865326, '仙居县人民医院'],
    [121.392748, 29.120496, '三门县人民医院'],
    [121.475374, 29.119666, '三门县人民医院（新院区）'],
    [119.913915, 28.456057, '丽水市中心医院'],
    [119.922298, 28.455428, '丽水市人民医院'],
    [119.159417, 28.083132, '龙泉市人民医院'],
    [120.293975, 28.135285, '青田县人民医院'],
    [119.587319, 28.106976, '云和县人民医院'],
    [119.066699, 27.629208, '庆元县人民医院'],
    [120.090662, 28.672607, '缙云县人民医院'],
    [119.278556, 28.600641, '遂昌县人民医院'],
    [119.506731, 28.452777, '松阳县人民医院'],
    [119.643382, 27.977596, '景宁畲族自治县人民医院']
    
    
]);
$array_data=  json_encode([[118.555816, 24.937791, '鲤城区浮桥街道延陵社区珑景湾小区'],
[118.655887, 24.920021, '丰泽区城东街道浔美社区东莲花苑'],
[118.627531, 24.879378, '丰泽区东海街道海景社区海景国际星域'],
[118.61958, 24.89497, '丰泽区好医联医疗耳鼻喉科'],
[118.635271, 25.142728, '洛江区马甲镇潘内村顶道坝'],
[118.603325, 24.784563, '晋江市新塘街道沙塘社区'],
[118.627435, 24.787955, '晋江市新塘街道杏坂社区'],
[118.620254, 24.82585, '晋江市杏坂社区卫生所'],
[118.572981, 24.821369, '晋江市金井镇万佳东方酒店'],
[118.589652, 24.638416, '晋江市英林镇英林村晋南小区'],
[118.573904, 24.622402, '晋江市英林镇同芳药店'],
[118.567821, 24.603411, '晋江市英林镇嘉排村'],
[118.581178, 24.628384, '晋江市英林镇西埔村'],
[118.548349, 24.641112, '晋江市东石镇山兜村'],
[118.525053, 24.816625, '晋江市磁灶镇张林村'],
[118.534325, 24.804105, '晋江市张林菜市场'],
[118.585492, 24.834817, '晋江市梅岭街道泉安中路速8酒店'],
[118.608198, 24.823749, '晋江市陈埭镇花厅口村'],
[118.707098, 24.754262, '石狮市蚶江镇山前东区'],
[118.66184, 24.762579, '石狮市宝盖镇后垵村'],
[118.483601, 24.868418, '南安市官桥镇下洋村后林埔'],
[118.363506, 25.00743, '南安市美林街道溪口村'],
[118.413585, 24.965169, '南安市南安市行政服务中心'],
[118.406965, 24.970623, '南安市中国工商银行南安柳城分行'],
[118.39935, 24.989907, '南安市美林街道西美村'],
[118.363506, 25.00743, '南安市溪口村卫生室'],
[118.374345, 24.697635, '南安市水头镇仁福村'],
[118.229594, 24.96974, '南安市英都镇良山村'],
[118.429245, 24.773016, '南安市官桥镇内厝村'],
[118.424992, 24.804321, '南安市官桥镇周厝村'],
[118.435324, 24.80649, '南安市官桥镇金庄街永生堂诊所'],
[118.483601, 24.868418, '南安市官桥镇下洋村后林埔'],
[118.327716, 25.208755, '南安市码头镇大庭村'],
[118.327716, 25.208755, '南安市码头镇大庭村卫生所'],
[118.352657, 24.696123, '南安市水头镇劳光村'],
[118.439912, 24.709904, '南安市水头菜市场桥西街'],
[118.297038, 25.011582, '南安市仑苍镇湖西新村'],
[118.300102, 25.010516, '南安市仑苍镇联盟村'],
[118.287605, 25.021614, '南安市仑苍镇园美村'],
[118.073228, 25.027181, '安溪县官桥镇恒美村安溪县官桥镇恒美村'],
[118.073228, 25.027181, '安溪县官桥镇恒美村第三卫生所'],
[118.190851, 25.047792, '安溪县城厢镇仙苑'],
[118.125727, 25.126345, '安溪县安溪清水岩'],
[117.967192, 25.265111, '安溪县湖上乡雪山村中洋'],
[118.411263, 25.374, '永春县湖洋镇龙山村'],
[118.409273, 25.307149, '永春县东关镇外碧村'],
[118.462637, 25.33048, '永春县外山乡碧卿林场'],
[118.344621, 25.309582, '永春县东平镇太平村'],
[118.304307, 25.354006, '永春县桃城镇太坪新村'],
[118.302539, 25.330032, '永春县金龙城董记咯摊'],
[118.29963, 25.322895, '永春县永春新华都超市'],
[118.047568, 25.365534, '永春县玉斗镇新珩村'],
[118.0462, 25.395715, '永春县玉斗镇玉斗村'],
[118.888535, 24.911414, '惠安县山霞镇东坑村青山街'],
[118.869104, 24.912165, '惠安县山霞镇田边村'],
[118.817154, 24.989265, '惠安县涂寨镇庄内村'],



[120.108027, 30.315681, '西湖区三墩镇西城年华'],
[120.396026, 30.306096, '钱塘新区白杨街道朗诗国际街区'],
[120.077381, 30.356829, '余杭区良渚街道奥克斯缔逸城'],
[120.030673, 30.21581, '西湖区留下街道石马新村'],
[120.175165, 30.23532, '上城区紫阳街道严官巷'],
[120.287345, 29.951382, '萧山区浦阳镇江西俞村'],
[120.225773, 30.373775, '江干区丁兰街道沿山村'],
[119.518472, 29.761107, '桐庐县钟山乡城下村'],
[120.443341, 30.240638, '萧山区空港大道杭州萧山国际机场'],
[120.20564, 30.270276, '江干区凯旋街道金秋花园'],
[120.169689, 30.306466, '拱墅区大关街道大关南七苑'],
[120.307479, 30.31758, '钱塘新区下沙街道朗诗国际街区东园'],
[120.307479, 30.31758, '钱塘新区下沙街道朗诗国际街区东园'],
[120.121237, 29.932051, '萧山区楼塔镇雪环桥头村'],
[120.3243, 30.301578, '钱塘新区下沙街道七格小区'],
[120.20564, 30.270276, '江干区凯旋街道金秋花园'],
[120.385683, 30.290642, '钱塘新区白杨街道宋都晨光国际'],
[120.077381, 30.356829, '余杭区良渚街道奥克斯缔逸城'],
[120.169689, 30.306466, '拱墅区大关街道大关南七苑'],
[119.704013, 29.809669, '桐庐县城南街道阳光华庭'],
[119.697599, 29.798585, '桐庐县'],
[120.499494, 30.325788, '钱塘新区'],
[119.287398, 29.481154, '建德市'],
[120.443341, 30.240638, '萧山区空港大道杭州萧山国际机场'],
[120.270471, 30.187511, '萧山区'],
[120.270471, 30.187511, '萧山区'],
[120.270471, 30.187511, '萧山区'],
[119.966556, 30.054723, '富阳区'],
[120.187607, 30.286744, '下城区'],
[120.306592, 30.424739, '余杭区'],
[119.697599, 29.798585, '桐庐县'],
[119.287398, 29.481154, '建德市'],
[120.136438, 30.265916, '西湖区'],
[120.306592, 30.424739, '余杭区'],
[120.306592, 30.424739, '余杭区'],
[120.187607, 30.286744, '下城区'],
[120.211539, 30.263311, '江干区'],
[120.270471, 30.187511, '萧山区'],
[120.17, 30.25, '上城区'],
[120.443341, 30.240638, '萧山区空港大道杭州萧山国际机场'],
[120.443341, 30.240638, '萧山区空港大道杭州萧山国际机场'],
[119.697599, 29.798585, '桐庐县'],
[120.211539, 30.263311, '江干区'],
[120.306592, 30.424739, '余杭区'],
[120.17, 30.25, '上城区'],
[120.306592, 30.424739, '余杭区'],
[120.270471, 30.187511, '萧山区'],
[120.306592, 30.424739, '余杭区'],
[120.211539, 30.263311, '江干区'],
[120.306592, 30.424739, '余杭区'],
[120.211539, 30.263311, '江干区'],
[119.697599, 29.798585, '桐庐县'],
[120.17, 30.25, '上城区'],
[120.211539, 30.263311, '桐庐县'],
[120.148447, 30.324643, '拱墅区'],
[120.306592, 30.424739, '余杭区'],
[120.136438, 30.265916, '西湖区'],
[120.306592, 30.424739, '余杭区'],
[120.211539, 30.263311, '江干区'],
[120.211539, 30.263311, '桐庐县'],
[120.211539, 30.263311, '桐庐县'],
[120.218471, 30.214333, '滨江区'],
[120.211539, 30.263311, '桐庐县'],
[120.148447, 30.324643, '拱墅区'],
[120.148447, 30.324643, '拱墅区'],
[120.148447, 30.324643, '拱墅区'],
[120.306592, 30.424739, '余杭区'],
[120.211539, 30.263311, '桐庐县'],
[120.443341, 30.240638, '萧山区空港大道杭州萧山国际机场'],
[120.306592, 30.424739, '余杭区'],
[120.306592, 30.424739, '余杭区'],
[120.499494, 30.325788, '钱塘新区'],
[119.731517, 30.239806, '临安区'],
[120.270471, 30.187511, '萧山区'],
[120.306592, 30.424739, '余杭区'],
[120.306592, 30.424739, '余杭区'],
[120.306592, 30.424739, '余杭区'],
[120.211539, 30.263311, '桐庐县'],
[120.148447, 30.324643, '拱墅区'],
[120.148447, 30.324643, '拱墅区'],
[120.148447, 30.324643, '拱墅区'],
[120.17, 30.25, '上城区'],
[120.17, 30.25, '上城区'],
[119.966556, 30.054723, '富阳区'],
[120.211539, 30.263311, '桐庐县'],
[120.211539, 30.263311, '桐庐县'],
[120.306592, 30.424739, '余杭区'],
[120.270471, 30.187511, '萧山区'],
[120.306592, 30.424739, '余杭区'],
[120.148447, 30.324643, '拱墅区'],
[120.148447, 30.324643, '拱墅区'],
[120.270471, 30.187511, '萧山区'],
[120.211539, 30.263311, '桐庐县'],
[120.136438, 30.265916, '西湖区'],
[120.306592, 30.424739, '余杭区'],
[120.211539, 30.263311, '江干区'],
[120.136438, 30.265916, '西湖区'],
[120.136438, 30.265916, '西湖区'],
[120.270471, 30.187511, '萧山区'],
[120.270471, 30.187511, '萧山区'],
[120.211539, 30.263311, '桐庐县'],
[120.443341, 30.240638, '萧山区空港大道杭州萧山国际机场'],
[120.187607, 30.286744, '下城区'],
[120.218471, 30.214333, '滨江区'],
[120.306592, 30.424739, '余杭区'],
[120.306592, 30.424739, '余杭区'],
[120.136438, 30.265916, '西湖区'],
[120.270471, 30.187511, '萧山区'],
[120.211539, 30.263311, '桐庐县'],
[119.287398, 29.481154, '建德市'],
[120.211539, 30.263311, '江干区'],
[120.211539, 30.263311, '江干区'],
[119.966556, 30.054723, '富阳区'],
[120.270471, 30.187511, '萧山区'],
[120.136438, 30.265916, '西湖区'],
[120.136438, 30.265916, '西湖区'],
[120.306592, 30.424739, '余杭区'],
[119.731517, 30.239806, '临安区'],
[120.306592, 30.424739, '余杭区'],
[120.270471, 30.187511, '萧山区'],
[120.306592, 30.424739, '余杭区'],
[119.966556, 30.054723, '富阳区'],
[120.211539, 30.263311, '桐庐县'],
[120.443341, 30.240638, '萧山区空港大道杭州萧山国际机场'],
[120.187607, 30.286744, '下城区'],
[120.211539, 30.263311, '江干区'],
[120.136438, 30.265916, '西湖区'],
[120.443341, 30.240638, '萧山区空港大道杭州萧山国际机场'],
[119.731517, 30.239806, '临安区'],
[120.499494, 30.325788, '钱塘新区'],
[120.211539, 30.263311, '桐庐县'],
[120.306592, 30.424739, '余杭区'],
[120.306592, 30.424739, '余杭区'],
[120.211539, 30.263311, '桐庐县'],
[120.270471, 30.187511, '萧山区'],
[120.17, 30.25, '上城区'],
[120.187607, 30.286744, '下城区'],
[120.218471, 30.214333, '滨江区'],
[120.17, 30.25, '上城区'],
[120.211539, 30.263311, '江干区'],
[120.306592, 30.424739, '余杭区'],
[119.731517, 30.239806, '临安区'],
[120.187607, 30.286744, '下城区'],
[120.306592, 30.424739, '余杭区'],
[120.136438, 30.265916, '西湖区'],
[120.270471, 30.187511, '萧山区'],
[120.306592, 30.424739, '余杭区'],
[119.731517, 30.239806, '临安区'],
[120.218471, 30.214333, '滨江区'],
[120.306592, 30.424739, '余杭区'],
[120.443341, 30.240638, '萧山区空港大道杭州萧山国际机场'],
[120.443341, 30.240638, '萧山区空港大道杭州萧山国际机场'],
[119.966556, 30.054723, '富阳区']


]);
//输出小区
echo '<script type="text/javascript">';
echo 'var data_info = ';
echo $array_data;
echo ';';

//输出医院
echo 'var data_hsp = ';
echo $array_hsp;
echo ';';
echo '</script>';
?>

<!DOCTYPE html>
<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
	<meta name="viewport" content="initial-scale=1.0, user-scalable=no" />
	<style type="text/css">
		body, html,#allmap {width: 100%;height: 100%;overflow: hidden;margin:0;font-family:"微软雅黑";}
		#l-map{height:100%;width:78%;float:left;border-right:2px solid #bcbcbc;}
		#r-result{height:100%;width:20%;float:left;}
    </style>
	<script type="text/javascript" src="http://api.map.baidu.com/api?v=2.0&ak=3ccb5362c4712a1dd2df47f58f49188a"></script>
	<script type="text/javascript" src="http://api.map.baidu.com/library/TextIconOverlay/1.2/src/TextIconOverlay_min.js"></script>
	<script type="text/javascript" src="http://api.map.baidu.com/library/MarkerClusterer/1.2/src/MarkerClusterer_min.js"></script>
	
	<title>疫情地图</title>
</head>
<body>
	<div id="allmap"></div>
</body>
</html>

<script type="text/javascript">
	// 百度地图API功能
	var map = new BMap.Map("allmap");
    // map.centerAndZoom("泉州",12);  
    map.centerAndZoom(new BMap.Point(118.680144,24.880476), 13);//须显式设置地图中心，不然会报错
		map.enableScrollWheelZoom();   //启用滚轮放大缩小，默认禁用
    map.enableContinuousZoom();    //启用地图惯性拖拽，默认禁用
    
    //初始化打点数据
    var markers=[];
    var markers2=[];
    //初始化点聚合
    var markerClusterer1=new BMapLib.MarkerClusterer(map, {markers:markers});
    var markerClusterer2=new BMapLib.MarkerClusterer(map, {markers:markers2});
    var myStyles = [{
                url: 'image/no1.jfif',
                size: new BMap.Size(30, 26),
                opt_anchor: [16, 0],
                textColor: '#ff00ff',
                opt_textSize: 10
            }, {
                url: 'image/no2.jfif',
                size: new BMap.Size(40, 35),
                opt_anchor: [40, 35],
                textColor: '#ff0000',
                opt_textSize: 12
            }, {
                url: 'image/no3.jfif',
                size: new BMap.Size(50, 44),
                opt_anchor: [32, 0],
                textColor: 'white',
                opt_textSize: 14
            }];
    markerClusterer2.setStyles(myStyles);
    markerClusterer1.setGridSize(100);
	// 编写自定义函数,创建标注
	// 编写自定义函数,创建标注
	
	
	
	var top_left_control = new BMap.ScaleControl({anchor: BMAP_ANCHOR_TOP_LEFT});// 左上角，添加比例尺
	var top_left_navigation = new BMap.NavigationControl();  //左上角，添加默认缩放平移控件
	var top_right_navigation = new BMap.NavigationControl({anchor: BMAP_ANCHOR_TOP_RIGHT, type: BMAP_NAVIGATION_CONTROL_SMALL}); //右上角，仅包含平移和缩放按钮
	/*缩放控件type有四种类型:
	BMAP_NAVIGATION_CONTROL_SMALL：仅包含平移和缩放按钮；BMAP_NAVIGATION_CONTROL_PAN:仅包含平移按钮；BMAP_NAVIGATION_CONTROL_ZOOM：仅包含缩放按钮*/
	


	//添加控件和比例尺
		map.addControl(top_left_control);        
		map.addControl(top_left_navigation);     
		// map.addControl(top_right_navigation);    

	
	var size = new BMap.Size(10, 20);
	map.addControl(new BMap.CityListControl({
    anchor: BMAP_ANCHOR_TOP_RIGHT,
    offset: size,
    // 切换城市之前事件
    // onChangeBefore: function(){
    //    alert('before');
    // },
    // 切换城市之后事件
    // onChangeAfter:function(){
    //   alert('after');
    // }
	}));
	

	var opts = {
				width : 250,     // 信息窗口宽度
				height: 80,     // 信息窗口高度
				title : "详细信息" , // 信息窗口标题
				enableMessage:true//设置允许信息窗发送短息
			   };

	function addClickHandler(content,marker){
		marker.addEventListener("click",function(e){
			openInfo(content,e)}
		);
	};
	function openInfo(content,e){
		var p = e.target;
		var point = new BMap.Point(p.getPosition().lng, p.getPosition().lat);
		var infoWindow = new BMap.InfoWindow(content,opts);  // 创建信息窗口对象 
		map.openInfoWindow(infoWindow,point); //开启信息窗口
	};


//为什么不写成直接函数封装呢？因为这样就只运行一次了，我也不知道为什么
//后面可以把医院的聚合改个样式，具体参考TextIconOverlay类做修改
map.addEventListener("dragend",function(){  
    UpdateThings();
});
map.addEventListener("zoomend",function(){  
    UpdateThings();
});

function UpdateThings(){
    var zoom=map.getZoom();
				// console.log(zoom)
				if(zoom<15){
					//获取屏幕边界
					var bound=map.getBounds();
                    //清除以前的点
                    markerClusterer1.clearMarkers(markers);
                    markerClusterer2.clearMarkers(markers2);
                    //清除数组的数据
                    markers=[];
                    markers2=[];
                    //添加小区和医院数据
                    for (var i=0; i<data_info.length; i++) {
                        pt = new BMap.Point(data_info[i][0],data_info[i][1]);
                        if (bound.containsPoint(pt) && mAS_INFO.show){  
                        var marker1 = new BMap.Marker(pt);        // 创建标注  
                        var content = data_info[i][2];

                        markers.push(marker1);
                        addClickHandler(content,marker1);                          
                        }
                    }
                    for (var i=0; i<data_hsp.length; i++) {
                        pt = new BMap.Point(data_hsp[i][0],data_hsp[i][1]);
                        if (bound.containsPoint(pt) && mAS_HSP.show){  
                            var content = data_hsp[i][2];
                            var myIcon = new BMap.Icon("image/hsp.png", new BMap.Size(24,24));

                            var marker2 = new BMap.Marker(pt,{icon:myIcon});        // 创建标注    
                            markers2.push(marker2);
                            addClickHandler(content,marker2);                             
                        }
                    }
                    //添加聚合点
                    markerClusterer1.addMarkers(markers);
                    markerClusterer2.addMarkers(markers2);
}
}

// 定义一个控件类,即function
function AttributeShow(what,size){
	  // 默认停靠位置和偏移量
	  this.defaultAnchor = BMAP_ANCHOR_TOP_RIGHT;
	  this.defaultOffset = new BMap.Size(10, size);
      this.what = what;
      this.show = true;
	}

	// 通过JavaScript的prototype属性继承于BMap.Control
	AttributeShow.prototype = new BMap.Control();

	// 自定义控件必须实现自己的initialize方法,并且将控件的DOM元素返回
	// 在本方法中创建个div元素作为控件的容器,并将其添加到地图容器中
	AttributeShow.prototype.initialize = function(map){
	  // 创建一个DOM元素
	  var div = document.createElement("div");
      var That = this;
	  // 添加文字说明
	  div.appendChild(document.createTextNode("隐藏"+That.what));
	  // 设置样式
	  div.style.cursor = "pointer";
	  div.style.border = "1px solid gray";
	  div.style.backgroundColor = "white";
	  div.onclick = function(e){
        if (That.show){
            That.show = false;
            div.firstChild.nodeValue = "显式"+That.what;
        }
        else{
            That.show = true;
            div.firstChild.nodeValue = "隐藏"+That.what;
        }
        UpdateThings();
	  }
	  // 添加DOM元素到地图中
	  map.getContainer().appendChild(div);
	  // 将DOM元素返回
	  return div;
	}
	// 创建控件
	var mAS_HSP = new AttributeShow("医院",80);
    var mAS_INFO = new AttributeShow("小区",120);
	// 添加到地图当中
	map.addControl(mAS_HSP);
    map.addControl(mAS_INFO);
    UpdateThings();
</script>



